---
layout: post
status: publish
published: true
title: Login com Facebook em PHP (OAuth)
author:
  display_name: Glauco Custódio
date: '2012-08-07 20:47:58 -0300'
date_gmt: '2012-08-07 20:47:58 -0300'
categories:
- PHP
tags:
- php
- facebook
- oauth
comments:
- id: 99
  author: Anderson Viral
  author_email: producao@agenciaviral.com
  author_url: http://agenciaviral.com
  date: '2012-11-17 11:37:39 -0200'
  date_gmt: '2012-11-17 11:37:39 -0200'
  content: Amigo, fiz tudo direitinho em meu server web, por&eacute;m nada funcionou.
    At&eacute; permito o app, mas quando redireciona n&atilde;o aparece nada no html.
    O que pode ser? Todos modelos que testei de conex&atilde;o que encontrei fizeram
    a mesma coisa... Estranho n&atilde;o?
- id: 100
  author: Anderson Viral
  author_email: producao@agenciaviral.com
  author_url: http://agenciaviral.com
  date: '2012-11-17 12:02:48 -0200'
  date_gmt: '2012-11-17 12:02:48 -0200'
  content: "&Eacute;. at&eacute; setei l&aacute; na APP as permiss&otilde;es que passei
    id&ecirc;nticas pela URL html... e nada. A url de retorno volta pra index.php
    e tudo em branco. Mesmo com o c&oacute;digo html que n&atilde;o consta aqui, que
    est&aacute; no seu gitHub.. o que ser&aacute;? vc j&aacute; se deparou com isso?"
- id: 368
  author: Matheus Afonso
  author_email: matheusafonso65@gmail.com
  author_url: http://www.matheusafonso.com
  date: '2013-02-17 02:05:29 -0300'
  date_gmt: '2013-02-17 02:05:29 -0300'
  content: Gostei muito fera!!! Bem simples e r&aacute;pido para intender! Parab&eacute;ns
    pelo post.
- id: 424
  author: Isael Ferreira
  author_email: isaelfm@gmail.com
  author_url: ''
  date: '2013-03-14 21:05:13 -0300'
  date_gmt: '2013-03-14 21:05:13 -0300'
  content: "Que massa cara, ficou &oacute;timo tanto o tutorial como o c&oacute;digo
    funcionou perfeitamente t&aacute; de parab&eacute;ns. :D\r\nEu tava quebrando
    a cabe&ccedil;a lendo aqueles tutoriais do Dev facebook."
- id: 462
  author: Renato
  author_email: renatoweb2.0@hotmail.com
  author_url: ''
  date: '2013-03-22 13:54:56 -0300'
  date_gmt: '2013-03-22 13:54:56 -0300'
  content: "Como faz pra instalar a extens&atilde;o &ldquo;openssl&rdquo;? obs.: leigo\r\nValewww"
- id: 550
  author: Wagner
  author_email: wagnerlucian@gmail.com
  author_url: ''
  date: '2013-04-29 14:21:05 -0300'
  date_gmt: '2013-04-29 14:21:05 -0300'
  content: Muito bom ! muito bem comentado os c&oacute;digos e o texto muito bem escrito
    cara ! parab&eacute;ns
- id: 591
  author: Adriana
  author_email: amvvaz@hotmail.com
  author_url: ''
  date: '2013-05-13 16:25:47 -0300'
  date_gmt: '2013-05-13 16:25:47 -0300'
  content: "* Loga usu&aacute;rio na sess&atilde;o. Substitua as linhas abaixo pelo
    seu c&oacute;digo de registro de usu&aacute;rios logados\r\n        *&#47;\r\n
    \       $_SESSION['user_data']['email'] = $user->email;\r\n        $_SESSION['user_data']['name']
    = $user->name;\r\n\r\nN&atilde;o percebo esta parte. \"c&oacute;digo de registo
    de usu&aacute;rios logados\". Tenho de escrever exatamente o que e onde?\r\n\r\nObrigado"
- id: 646
  author: Daniel Medina
  author_email: j.danielmedina@gmail.com
  author_url: http://daniel.bluestage.net/
  date: '2013-05-27 03:11:03 -0300'
  date_gmt: '2013-05-27 03:11:03 -0300'
  content: "Ol&aacute;, finalmente consegui ligar o meu site ao Facebook.\r\nDesde
    j&aacute; quero dar os parab&eacute;ns pelo c&oacute;digo estar limpo e bem comentado,
    isso ajuda-nos bastante.\r\n\r\nN&atilde;o testei o seu c&oacute;digo, implementei-o
    aos poucos no meu site e deparei com alguns problemas j&aacute; corrigidos.\r\nAgora
    sim, sei como funciona este mecanismo.\r\n\r\nAh, tirei o seguinte c&oacute;digo
    porque me dava erro. \r\n\"if($response){ \r\n    $params = null;\r\n    parse_str($response,
    $params);\r\n}\"\r\n\r\nO facebook devolveu-me o conte&uacute;do j&aacute; com
    '?access_token=' foi s&oacute; remover e colocar a vari&aacute;vel $response.\r\n\r\nAssim
    que puder deixo o link da adapta&ccedil;&atilde;o que fiz.\r\n\r\nAbra&ccedil;o."
- id: 754
  author: Fabio Fernando da Silva rocha
  author_email: fabiorokfernn@hotmail.com
  author_url: http://eumudeidevida.com.br/?ref=rocha
  date: '2013-06-22 20:37:50 -0300'
  date_gmt: '2013-06-22 20:37:50 -0300'
  content: "Deixe seu negocio no piloto automatico, atraia centenas de afiliados para
    sua rede.\r\n\r\nAssista o video e saiba como automatizar e obter uma explosao
    de afiliados em sua rede."
- id: 964
  author: eduardo herdem campos
  author_email: eduardohc@xvideos.com
  author_url: ''
  date: '2013-07-24 19:46:56 -0300'
  date_gmt: '2013-07-24 19:46:56 -0300'
  content: "adorei seu post meu amigo\r\nte parabenizo pelo blog\r\n\r\nEduardo Herdem
    Campos"
- id: 1088
  author: Cerebro Vasconcelos
  author_email: cerebro.vasconcelos@zipmail.com.br
  author_url: http://cerebrovasconcelos.tumblr.com/
  date: '2013-08-08 12:58:27 -0300'
  date_gmt: '2013-08-08 12:58:27 -0300'
  content: Parece bom, mas ainda num testei, vou testar em breve
- id: 1218
  author: Joao
  author_email: jovimalhaes@hotmail.com
  author_url: ''
  date: '2013-09-06 03:30:47 -0300'
  date_gmt: '2013-09-06 03:30:47 -0300'
  content: Ae cara, tutorial maneiro. Me fala ai quais s&atilde;o os echos das SESSIONs
    para por no meu site. A sess&atilde;o fica logada at&eacute; sair do fb? Eeee
    n&atilde;o entendi a linha 40 do &uacute;ltimo c&oacute;digo
- id: 1376
  author: Alex
  author_email: Alex.f.soares@hotmail.com
  author_url: ''
  date: '2013-10-16 14:12:45 -0300'
  date_gmt: '2013-10-16 14:12:45 -0300'
  content: Ol&aacute;, eu estou com problema, a minha URL &eacute; localhost&#47;etc,
    e ent&atilde;o configurei para vhost, por&eacute;m o campo site url n&atilde;o
    aceita, e localhost&#47;etc apesar de aceitar como valido n&atilde;o ir&aacute;
    funcionar como espera e j&aacute; citado aqui! O que fazer? Lembrando que ja configurei
    o apache tudo certinho, acessando as coisas e tudo mais, entretanto e o &uacute;nico
    problema &eacute; que n&atilde;o &eacute; aceito
- id: 1382
  author: Alex
  author_email: Alex.f.soares@hotmail.com
  author_url: ''
  date: '2013-10-17 17:19:24 -0300'
  date_gmt: '2013-10-17 17:19:24 -0300'
  content: Algu&eacute;m fez esse tutorial utilizando virtual hosts, me da uma for&ccedil;a,
    to precisando muito!
- id: 1405
  author: getulio
  author_email: getuliolobo@msn.com
  author_url: ''
  date: '2013-10-24 12:46:52 -0200'
  date_gmt: '2013-10-24 12:46:52 -0200'
  content: "o meu ta dando erro parceiro, qual a M que eu to fazendo?\r\n\r\nhttp:&#47;&#47;www.brotherbusiness.com.br&#47;facebook&#47;\r\n\r\nParabens
    pelo post"
- id: 1497
  author: alison Silva
  author_email: alison.geek@gmail.com
  author_url: ''
  date: '2013-11-26 19:01:29 -0200'
  date_gmt: '2013-11-26 19:01:29 -0200'
  content: '&Oacute;tima tutorial parab&eacute;ns , eu comecei a desenvolver para
    Web faz pouco tempo e me deparei com a necessidade de colocar uma autentica&ccedil;&atilde;o
    atrav&eacute;s do facebook em um site porem s&oacute; da erro "Falha ao logar
    no Facebook" oque pode ser ? teria como me dar um help ou gravar um video rsrs
    ??'
- id: 1917
  author: P&igrave;tter
  author_email: pitter775@gmail.com
  author_url: http://www.embudasartes.sp.gov.br/
  date: '2014-04-11 20:14:23 -0300'
  date_gmt: '2014-04-11 20:14:23 -0300'
  content: Do caralho! Parab&eacute;ns mlk!
- id: 9333
  author: R-TI
  author_email: rogerioti@rocketmail.com
  author_url: ''
  date: '2014-09-16 11:01:06 -0300'
  date_gmt: '2014-09-16 11:01:06 -0300'
  content: "Glauco Cust&oacute;dio, o post &eacute; um pouco antigo, mas se puder
    me ajudar, fico grato.\r\n\r\nQuando logo com o meu facebook o sistema funciona
    corretamente, por&eacute;m quando logo com outra conta ele dar erro dizendo que
    o aplicativo n&atilde;o foi configurado corretamente. Onde estou errando?"
- id: 12313
  author: Piterson
  author_email: piterson_puma@hotmail.com
  author_url: http://desenvolvimento
  date: '2014-10-06 18:55:10 -0300'
  date_gmt: '2014-10-06 18:55:10 -0300'
  content: Show de bola Glauco  funcionou certinho parabens
- id: 13335
  author: aldenice meneses aguiar
  author_email: nicelimaaguiar@gmail.com
  author_url: ''
  date: '2014-10-10 17:25:40 -0300'
  date_gmt: '2014-10-10 17:25:40 -0300'
  content: tudo muito bom
- id: 16059
  author: Roberta
  author_email: meunamoro1@outlook.com
  author_url: http://www.meunamoro.com.br
  date: '2014-11-10 18:47:19 -0200'
  date_gmt: '2014-11-10 18:47:19 -0200'
  content: "muito obrigado, isso vai facilitar muito para as pessoas no Meu Namoro\r\n\r\nhttp:&#47;&#47;www.meunamoro.com.br"
- id: 20189
  author: jogos de acao
  author_email: kraig_passmore@gmail.com
  author_url: http://zombiegames.ofertou.com/
  date: '2015-01-17 19:48:05 -0200'
  date_gmt: '2015-01-17 19:48:05 -0200'
  content: Hello to every one, it's truly a good for me to visit this site, iit includes
    important Information.
- id: 39001
  author: Pika
  author_email: s@s.com
  author_url: http://www.glaucos.com.br
  date: '2015-08-20 22:32:56 -0300'
  date_gmt: '2015-08-20 22:32:56 -0300'
  content: "Pika !!!!.\r\n<a href=\"\" title=\"\" rel=\"nofollow\"> <abbr title=\"\">
    <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\">
    <em> <i> <q cite=\"\"> <strike> <strong>"
---
<p>Fala galera, beleza? Vocês já viram sistema de autenticação pelo Facebook em algum site? Sabe o que é?</p>

<p>Nesse post irei explicar como incluir login com Facebook (autenticação OAuth) em seu site usando PHP (portanto, server side). É bem fácil, vamos ao tutorial.</p>

<a href="{{ site.baseurl }}/assets/facebook-oauth-login.jpg"><img class="alignnone  wp-image-235" title="Login com Facebook em PHP" src="{{ site.baseurl }}/assets/facebook-oauth-login.jpg" alt="Login com Facebook em PHP" /></a>

<p>Primeira coisa que precisamos é criar uma App no Facebook Developers, para isso, você deve ter um cadastro no Facebook (isso é fácil rs). Acesse o link <a title="http://developers.facebook.com" href="http://developers.facebook.com" target="_blank">http://developers.facebook.com</a>, clique em "Entrar" e digite seu email e senha do Facebook. Se ele pedir a senha novamente, digite mais uma vez, é por segurança.</p>

<p>Após o login, estaremos na página inicial do Facebook Developers, agora podemos criar nossa App. Clique em "Create New App", digite o nome da sua aplicação em "App Name" (eu colocaria algo como "Meu site - login") e clique em "Continue". Digite o código mostrado na imagem e pronto, sua app estará criada e você será redirecionado para página de configuração dela.</p>

<p><a href="{{ site.baseurl }}/assets/facebook-criar-nova-app.png"><img class="alignnone size-full wp-image-214" title="Criar App no Facebook" src="{{ site.baseurl }}/assets/facebook-criar-nova-app.png" alt="Criar App no Facebook"/></a></p>

<div class="alert">O Facebook pode pedir para confirmar sua conta solicitando um número de celular no qual ele enviará um código que deve ser digitado para continuar. Caso você tenha criado sua conta no Facebook a menos de 48 horas você pode ter problemas nessa etapa, mas, é só esperar esse prazo e tudo deve ocorrer normal (informação não oficial, encontrei em fóruns quando tive esse problema).</div>

<p>Estando tudo certo, agora você deve selecionar como sua aplicação se integrará com o Facebook, para isso, bastar marcar "Website with Facebook login", digitar o endereço do seu site que o Facebook irá redirecionar após fazer o login no campo "Site URL" e clicar em "Save Changes".</p>

<p><a href="http://blog.glaucocustodio.com/wp-content/uploads/2012/08/fb2.png"><img class="alignnone  wp-image-221" title="Configurando app no Facebook" src="http://blog.glaucocustodio.com/wp-content/uploads/2012/08/fb2.png" alt="Configurando app no Facebook"/></a></p>

<p>O campo "Site URL" deve ser preenchido com um domínio válido (algo como http://glaucocustodio.com), portanto você não pode inserir endereços como "http://localhost" ou "127.0.0.1" (endereços referentes à máquina local).</p>

<p>Mas como irei fazer isso se preciso testar em desenvolvimento (em sua máquina e não no servidor de hospedagem) primeiro antes de subir em produção (online)?</p>

<p>Essa é a pergunta que você pode estar se fazendo agora. Para resolver isso, você terá que criar um redirecionamento em seu arquivo hosts (em caso de Windows).</p>

<p>Abra um editor de texto como o bloco de notas como administrador, vá no menu <code>Arquivo -&gt; Abrir</code>, acesse esse endereço <code>C:\Windows\System32\drivers\etc</code> e clique para abrir o arquivo <code>hosts</code>, feito isso, adicione <code>127.0.0.1 meusitedev.com.br</code> (sem aspas) na última linha e salve o arquivo.</p>

<p>Agora abra o navegador e digite o endereço digitado acima (meusitedev.com.br) na barra de endereços e você deverá ver o conteúdo da pasta <code>www</code> do Apache, basta clicar na pasta do seu projeto e pronto, agora você pode desenvolver usando uma url como "http://meusitedev.com.br" invés de "http://localhost/meusite". Caso isso não funcione, procure por "hosts Windows" e "Virtual hosts Apache" no Google que você obterá ajuda fácil.</p>

<p>Após configurarmos nossa app no Facebook, já podemos começar a codificar.. Primeira coisa que devemos fazer é adicionar um link para o endereço de autenticação do Facebook:</p>

{% highlight html %}
<a href="https://www.facebook.com/dialog/oauth?client_id=YOUR_APP_ID&redirect_uri=YOUR_REDIRECT_URI&scope=COMMA_SEPARATED_LIST_OF_PERMISSION_NAMES">Entrar com Facebook</a>
{% endhighlight %}

<p>Substitua <code>YOUR_APP_ID</code> pelo id da sua aplicação e <code>YOUR_REDIRECT_URI</code> pelo endereço digitado no campo "Site URL" (aquele que deve ser um domínio válido). Ambos dados são encontrados na página de configuração de sua aplicação no Facebook Developers.</p>

<p>O parâmetro <code>scope</code> do link acima, diz para o Facebook quais são as permissões adicionais que seu site precisa para acessar dados dos usuários. Por padrão, o Facebook disponibiliza id, nome, sexo e localidade (locale) dos usuários, se você precisar de mais dados, como por exemplo o email (que também iremos precisar), você deve informar nesse parâmetro <code>scope</code> separado por vírgulas (ex: <code>scope=email, user_website</code>). Então substitua <code>COMMA_SEPARATED_LIST_OF_PERMISSION_NAMES</code> pelas permissões que você precisará ou remova <code>scope</code> e seu valor caso não precise de permissões adicionais.</p>

<p>Você deve ficar com um link como abaixo após as respectivas substituições.</p>

{% highlight html+php %}
<a href="https://www.facebook.com/dialog/oauth?client_id=104463303035318&scope=email&redirect_uri=<?php echo urlencode('http://projetos.com/glauco-blog-tutorials/Login%20com%20Facebook/') ?>">Entrar com Facebook</a>
{% endhighlight %}

<p>Se você clicar nele, será redirecionado para uma tela onde o Facebook solicita permissão para os itens definidos na variável <code>scope</code> acima e/ou apenas às informações básicas.</p>

<p><a href="{{ site.baseurl }}/assets/facebook-app.png"><img class="alignnone size-full wp-image-196" title="Login com Facebook" src="{{ site.baseurl }}/assets/facebook-app.png" alt="Login com Facebook" /></a></p>

<p>Clique em "Go to App" para conceder acesso e continuar. Feito isso, você verá que foi redirecionado para a url informada no campo "Site URL" e que agora ela possui uma variável chamada <code>code</code> na url. Nessa mesma página, iremos incluir o código PHP abaixo (no começo da página) para conseguirmos o token de acesso (acess token) e depois obtermos os dados do usuário.</p>

{% highlight php %}
<?php

// Verifica o tipo de requisição e se tem a variável 'code' na url
if($_SERVER['REQUEST_METHOD'] == 'GET' && isset($_GET['code'])){
  // Informe o id da app
  $appId = '104463303035318';
  // Senha da app
  $appSecret = 'sua_app_secret';
  // Url informada no campo "Site URL"
  $redirectUri = urlencode('http://projetos.com/glauco-blog-tutorials/Login%20com%20Facebook/');
  // Obtém o código da query string
  $code = $_GET['code'];
  
  // Monta a url para obter o token de acesso
  $token_url = "https://graph.facebook.com/oauth/access_token?"
  . "client_id=" . $appId . "&redirect_uri=" . $redirectUri
  . "&client_secret=" . $appSecret . "&code=" . $code;
  
  // Requisita token de acesso
  $response = @file_get_contents($token_url);
  
  if($response){
    $params = null;
    parse_str($response, $params);
    
    // Se veio o token de acesso
    if(isset($params['access_token']) && $params['access_token']){
      $graph_url = "https://graph.facebook.com/me?access_token="
      . $params['access_token'];
      
      // Obtém dados através do token de acesso
      $user = json_decode(file_get_contents($graph_url));
      
      // Se obteve os dados necessários
      if(isset($user->email) && $user->email){
        
        /*
        * Autenticação feita com sucesso. 
        * Loga usuário na sessão. Substitua as linhas abaixo pelo seu código de registro de usuários logados
        */
        $_SESSION['user_data']['email'] = $user->email;
        $_SESSION['user_data']['name'] = $user->name;
        
        /*
        * Aqui você pode adicionar um código que cadastra o email do usuário no banco de dados
        * A cada requisição feita em páginas de área restrita você verifica se o email
        * que está na sessão é um email cadastrado no banco
        */
      }
      
    }else{
      $_SESSION['fb_login_error'] = 'Falha ao logar no Facebook';
    }

  }else{
    $_SESSION['fb_login_error'] = 'Falha ao logar no Facebook';
  }
  
}else if($_SERVER['REQUEST_METHOD'] == 'GET' && isset($_GET['error'])){
  $_SESSION['fb_login_error'] = 'Permissão não concedida';
}
?>
{% endhighlight %}

<div class="note">Para executar o código acima você precisará ter a extensão <code>openssl</code> do PHP instalada.</div>

<p>Pronto! Agora você já tem seu sistema de login e senha com autenticação pelo Facebook. Você pode conferir o código completo desse exemplo em meu <a title="https://github.com/glaucocustodio/glauco-blog-tutorials/tree/master/Login%20com%20Facebook" rel="external nofollow" href="https://github.com/glaucocustodio/glauco-blog-tutorials/tree/master/Login%20com%20Facebook" target="_blank">GitHub</a>.</p>

<p>O que você achou? Gostou?</p>

<p>Até mais.</p>
