---
layout: post
status: publish
published: true
title: Come&ccedil;ando com Django - Instalando e Rodando no Linux
author:
  display_name: Glauco Custódio
date: '2013-01-10 20:49:29 -0200'
date_gmt: '2013-01-10 20:49:29 -0200'
categories:
- Python
tags:
- django
comments:
- id: 451
  author: Leandro
  author_email: leandro@professionalit.com.br
  author_url: http://blog.professionalit.com.br
  date: '2013-03-19 19:00:20 -0300'
  date_gmt: '2013-03-19 19:00:20 -0300'
  content: Muito Bom Glauco, parab&eacute;ns pelo tutorial.
- id: 477
  author: Henrique Leal
  author_email: hm.leal@hotmail.com
  author_url: ''
  date: '2013-03-26 11:48:14 -0300'
  date_gmt: '2013-03-26 11:48:14 -0300'
  content: "Muito bom o artigo, mas ainda acho que deveria ser incentivado a utiliza&ccedil;&atilde;o
    de um virtualenv pra separar a instala&ccedil;&atilde;o do Django do sistema ;)\r\n\r\nNo
    mais excelente artigo, e considero o melhor framework da atualidade.\r\n\r\nAbra&ccedil;os"
- id: 478
  author: Glauco Cust&oacute;dio
  author_email: glauco.custodio@gmail.com
  author_url: http://glaucocustodio.com
  date: '2013-03-26 12:00:25 -0300'
  date_gmt: '2013-03-26 12:00:25 -0300'
  content: "Virtualenv &eacute; bom, &eacute; que no meu caso n&atilde;o se aplica,
    geralmente s&oacute; tenho uma vers&atilde;o do Django.\r\n\r\nMas &eacute; uma
    boa alternativa pra quem precisa de ambientes heterog&ecirc;neos.\r\n\r\nAbra&ccedil;o."
- id: 677
  author: Helder Silva
  author_email: helder.dds@gmail.com
  author_url: ''
  date: '2013-06-04 17:49:10 -0300'
  date_gmt: '2013-06-04 17:49:10 -0300'
  content: "Muito bom o tutorial.\r\nS&oacute; faltou alguns detalhes, como:\r\n*
    ter o banco de dados j&aacute; criado e com o mesmo nome do projeto.\r\n* executar
    o comando \"python manage.py syncdb\", ap&oacute;s liberar a &aacute;rea do admin.\r\nSou
    iniciante, portanto essas informa&ccedil;&otilde;es me fizeram falta.\r\nMas estou
    muito satisfeito com os resultados.\r\nParab&eacute;ns pela iniciativa.\r\nMe
    ajudou muito, obrigado!"
- id: 1092
  author: Alex
  author_email: alex.cc20@hotmail.com
  author_url: ''
  date: '2013-08-09 23:08:13 -0300'
  date_gmt: '2013-08-09 23:08:13 -0300'
  content: Muito bom o tutorial cara, parab&eacute;ns!
- id: 1121
  author: red
  author_email: raymundoesjr@yahoo.com.br
  author_url: ''
  date: '2013-08-15 00:06:50 -0300'
  date_gmt: '2013-08-15 00:06:50 -0300'
  content: "Parab&eacute;ns pela continuidade em suas publica&ccedil;&otilde;es, e
    de qualidade!\r\n\r\n\"\r\nComo irei utilizar banco de dados MySQL e o gerenciador
    de pacotes PIP nesse tutorial, preciso instal&aacute;-los, rode o comando sudo
    apt-get install python-mysqldb python-pip e tudo deve estar ok.\r\n\r\nVamos baixar
    o Django agora, rode o comando wget https:&#47;&#47;www.djangoproject.com&#47;m&#47;releases&#47;1.4&#47;Django-1.4.3.tar.gz
    no terminal onde deseja salvar o arquivo ou entre no site.\r\n\"\r\n\r\nUma coisa,
    e se eu j&aacute; tiver instalado o xampp, o que s&oacute; preciso &eacute; instalar
    o pip e o django?\r\n\r\nAbra&ccedil;o!"
- id: 1186
  author: Lucas Gomide
  author_email: lucaslg200@gmail.com
  author_url: ''
  date: '2013-08-31 14:29:33 -0300'
  date_gmt: '2013-08-31 14:29:33 -0300'
  content: Cara muito louco, o Django &eacute; sensacional. Parab&eacute;ns pelo tutorial
    !
- id: 1204
  author: Gabriel Barreto
  author_email: gabriel_barreto_snp@hotmail.com
  author_url: ''
  date: '2013-09-03 13:30:00 -0300'
  date_gmt: '2013-09-03 13:30:00 -0300'
  content: "Eu gostei muito ficou &oacute;timo voc&ecirc;s poderiam me ajudar com
    uma coisa\r\n\r\neu gostaria de saber se tem como eu criar uma pagina ali igual
    fez com noticias mais agora de cadastro\r\ncom os campos\r\n\r\n- usu&aacute;rio\r\n-
    senha\r\n- base\r\n- IP\r\n- porta"
- id: 1230
  author: Sidney Soares
  author_email: contato@sidneysoares.com
  author_url: ''
  date: '2013-09-11 13:11:12 -0300'
  date_gmt: '2013-09-11 13:11:12 -0300'
  content: Fizeram falta para mim tamb&eacute;m, mas no geral o tutorial t&aacute;
    bem explicado.
- id: 1231
  author: Sidney Soares
  author_email: contato@sidneysoares.com
  author_url: ''
  date: '2013-09-11 13:27:34 -0300'
  date_gmt: '2013-09-11 13:27:34 -0300'
  content: O comando python manage.py syncdb n&atilde;o funciona...
- id: 1277
  author: lucas
  author_email: lucas@hotmail.com
  author_url: ''
  date: '2013-09-27 12:36:59 -0300'
  date_gmt: '2013-09-27 12:36:59 -0300'
  content: Glauco voc&ecirc; poderia criar mais tutorias de como criar aplica&ccedil;&otilde;es
    web no django
- id: 1317
  author: Gabriel Barreto
  author_email: gabriel_barreto_snp@hotmail.com
  author_url: ''
  date: '2013-10-04 14:40:55 -0300'
  date_gmt: '2013-10-04 14:40:55 -0300'
  content: ai por favor algu&eacute;m me ajuda, eu gostaria de saber como colocar
    um campo de select quem puder me ajudar fico grato.
- id: 1361
  author: Arthur
  author_email: arthur.4lves@gmail.com
  author_url: http://nop
  date: '2013-10-12 20:48:28 -0300'
  date_gmt: '2013-10-12 20:48:28 -0300'
  content: "Excelente amigo, precisava de um tutorial de django simples e pratico
    pra entender. S&oacute; aqui eu encontrei algo r&aacute;pido e bem explicado.\r\n\r\nParab&eacute;ns
    e Abrasss"
- id: 1481
  author: Regis
  author_email: rg3915@yahoo.com.br
  author_url: http://latexbr.blogspot.com.br/
  date: '2013-11-17 19:02:46 -0200'
  date_gmt: '2013-11-17 19:02:46 -0200'
  content: Parab&eacute;ns Glauco, agora s&oacute; falta voc&ecirc; fazer um post
    sobre os formul&aacute;rios.
- id: 1702
  author: Natanael Souza
  author_email: natan.cc@msn.com
  author_url: ''
  date: '2014-03-07 02:50:42 -0300'
  date_gmt: '2014-03-07 02:50:42 -0300'
  content: "Ol&aacute;, voc&ecirc; n&atilde;o ensina como criar o banco de dados,
    por&eacute;m o comando seria, \"create database meu_projeto;\"?\r\n\r\nEstou rodando
    esse c&oacute;digo no terminal do ubuntu 13.0 e tenho como resultado:  \"No comand
    create found\".\r\n\r\n\r\nObrigado pelo tutorial, est&aacute; muito bem organizado!!!"
- id: 1725
  author: Natanael Souza
  author_email: natan.cc@msn.com
  author_url: ''
  date: '2014-03-09 04:26:50 -0300'
  date_gmt: '2014-03-09 04:26:50 -0300'
  content: Acabei de terminar o tutorial, parab&eacute;ns. Estou ansioso por mais
    tutoriais de Django.
- id: 1811
  author: Natanael Souza
  author_email: nss@cin.ufpe.br
  author_url: ''
  date: '2014-04-03 17:28:04 -0300'
  date_gmt: '2014-04-03 17:28:04 -0300'
  content: "Fiz esse tutorial faz um tempo j&aacute;, voltei pra ver se tinha continua&ccedil;&atilde;o
    :D\r\nSe voc&ecirc; aceitar sugest&otilde;es, seria legal um guia pra manipular
    imagens e fazer um album de fotos :D"
- id: 2320
  author: Luan
  author_email: luansilima@gmail.com
  author_url: ''
  date: '2014-05-23 16:12:42 -0300'
  date_gmt: '2014-05-23 16:12:42 -0300'
  content: mto cara, parab&eacute;ns pelo seu trabalho mto bom msm
- id: 2864
  author: Edilson
  author_email: dinho326@gmail.com
  author_url: ''
  date: '2014-08-06 11:49:50 -0300'
  date_gmt: '2014-08-06 11:49:50 -0300'
  content: Parab&eacute;ns pelo tutorial brother, muito bom para quem t&aacute; iniciando.
- id: 2872
  author: diogo braga
  author_email: diogobsb@hotmail.com
  author_url: ''
  date: '2014-08-07 12:29:33 -0300'
  date_gmt: '2014-08-07 12:29:33 -0300'
  content: muito bom, parabens pela otima introdu&ccedil;&atilde;o ao django.
- id: 22993
  author: fernando
  author_email: fjanuarioazevedo@gmail.com
  author_url: ''
  date: '2015-03-02 03:36:04 -0300'
  date_gmt: '2015-03-02 03:36:04 -0300'
  content: esse tutorial top viu, valeuu.
- id: 23012
  author: Fl&aacute;vio Micheletti
  author_email: flaviomicheletti@hotmail.com
  author_url: http://www.devfuria.com.br
  date: '2015-03-02 10:28:19 -0300'
  date_gmt: '2015-03-02 10:28:19 -0300'
  content: 'A comunidade carece de artigos  como este: muito bem escrito e de f&aacute;cil
    acompanhamento! Parab&eacute;ns!'
- id: 23013
  author: Angelo
  author_email: angelo.gemini@gmail.com
  author_url: ''
  date: '2015-03-02 10:41:48 -0300'
  date_gmt: '2015-03-02 10:41:48 -0300'
  content: Excelente! R&aacute;pido e eficiente nas explica&ccedil;&otilde;es. Tentei
    aprender uma vez e a exper&ecirc;ncia n&atilde;o foi muito produtiva, mas depois
    deste seu material ficou show. Parab&eacute;ns
- id: 28149
  author: Anselmo
  author_email: anselmojacyntho@gmail.com
  author_url: ''
  date: '2015-04-18 01:22:57 -0300'
  date_gmt: '2015-04-18 01:22:57 -0300'
  content: "Cara, fant&aacute;stico! Estava em duvida se me dedicava a esse cara,
    mas a resposta j&aacute; &eacute; obvia! \r\n\r\nMuito obrigado"
- id: 28793
  author: 'BibSonomy :: url :: Come&ccedil;ando com Django &ndash; Instalando e Rodando
    no Linux | JustCode'
  author_email: ''
  author_url: http://www.bibsonomy.org/url/b9d88b9f287fe239a97ed7616211850d/christianoavila
  date: '2015-04-24 13:51:02 -0300'
  date_gmt: '2015-04-24 13:51:02 -0300'
  content: "[...] date&nbsp;|&nbsp; title ) order:&nbsp;( ascending&nbsp;|&nbsp; descending
    ) &nbsp;&nbsp;1Come&ccedil;ando com Django &ndash; Instalando e Rodando no Linux
    | JustCode&nbsp;Aqui o assunto &eacute; c&oacute;digo: Ruby, Python, Git, Linux
    e o que precisar. 4 minutes and 37 seconds ago [...]"
- id: 28896
  author: Jether Rodrigues
  author_email: jetherrodrigues@gmail.com
  author_url: http://www.i3focus.com.br
  date: '2015-04-25 19:36:08 -0300'
  date_gmt: '2015-04-25 19:36:08 -0300'
  content: "Muito bom, estou come&ccedil;ando com Django e gostei muito do tutorial.\r\nParab&eacute;ns.\r\n\r\nObs.:
    poderia utilizar o PIP para instalar o Django, fiz assim: pop install Django==1.8\r\n\r\nVlww!"
- id: 30731
  author: Pablo Ferreira
  author_email: unixpablo@hotmail.com
  author_url: http://unixpablo.blogspot.com.br/
  date: '2015-05-15 18:38:19 -0300'
  date_gmt: '2015-05-15 18:38:19 -0300'
  content: "N&atilde;o cheguei a testar esse tutorial para saber se, seguindo a risca,
    ele funcionaria. Mas acho que a iniciativa seria mais vista se voc&ecirc; colocasse
    uma tradu&ccedil;&atilde;o do documento oficial do Django.\r\n\r\nDjango &eacute;
    uma ferramenta para projetos profissionais, acho que os profissionais gostariam
    de visualizar um documento oficial para ter mais seguran&ccedil;a."
- id: 36622
  author: Jo&atilde;o Paulo
  author_email: jpaulo_pacheco@hotmail.com
  author_url: ''
  date: '2015-07-22 02:03:51 -0300'
  date_gmt: '2015-07-22 02:03:51 -0300'
  content: "<b>Parab&eacute;ns<b>pela iniciativa, a dificuldade do amigo do coment&aacute;rio
    &eacute; a mesma minha, estou buscando as solu&ccedil;&otilde;es. Pessoas como
    voc&ecirc; ( Glauco ) simplificam a vida e motivam as pessoas a vencer desafios.\r\nObrigado"
---
<p>E ai pessoal, tudo bom?</p>

<p>Venho falar de Django hoje, irei mostrar como preparar um ambiente de desenvolvimento no Linux (Ubuntu 12.04 LTS), explicar como essa ferramenta funciona e criar um projeto na prática. Se você não conhece o Django, recomendo que leia <a href="{% post_url 2012-07-31-porque-usar-um-framework %}" target="_blank">esse post</a> onde faço uma breve introdução.</p>

<a href="{{ site.baseurl }}/assets/começando-com-django-framework1.jpg"><img class="alignnone size-full wp-image-1104" title="começando-com-django-framework" src="{{ site.baseurl }}/assets/começando-com-django-framework1.jpg" alt="começando-com-django-framework"/></a>

<h2>Índice</h2>

<ul>
  <li><a href="#installation">Instalar ambiente de desenvolvimento Django 1.4 no Linux (Ubuntu)</a></li>
  <li><a href="#how-django-works">Aprender como Django trabalha</a></li>
  <li><a href="#creating-a-project">Criar um site (projeto)</a></li>
  <li><a href="#setting-project">Configurar um projeto</a></li>
  <li><a href="#creating-a-plugable-application">Criar uma aplicação plugável (sistema de notícias)</a></li>
  <li><a href="#admin-interface">Gerenciar registros pela área administrativa</a></li>
  <li><a href="#displaying-records">Listar registros</a>
    <ul>
      <li><a href="#urls">Urls</a></li>
      <li><a href="#views">Views</a></li>
      <li><a href="#templates">Templates</a></li>
    </ul>
  </li>
</ul>

<h2 id="installation">Instalação</h2>

<p>Os passos abaixo são destinados para Linux Ubuntu (12.04 LTS), caso você esteja no Windows e não queira trocar (o que não é recomendado), pode ver como preparar um ambiente de desenvolvimento <a title="Instalando Django no Windows" href="{% post_url 2012-08-02-instalar-django-no-windows %}" target="_blank">aqui</a>.</p>

<p>Django é um framework escrito em Python, por isso não precisamos nos preoupar com a linguagem no Linux porque ela já vem instalada.</p>

<p>Como irei utilizar banco de dados MySQL e o gerenciador de pacotes PIP nesse tutorial, preciso instalá-los, rode o comando <code>sudo apt-get install python-mysqldb python-pip</code> e tudo deve estar ok.</p>

<p>Instale também as bibliotecas <code>libmysqlclient-dev</code> e <code>python-dev</code> através do comando <code>sudo apt-get install libmysqlclient-dev python-dev</code>.</p>

<p>Vamos baixar o Django agora, rode o comando <code>wget https://www.djangoproject.com/m/releases/1.4/Django-1.4.3.tar.gz</code> no terminal onde deseja salvar o arquivo ou entre no <a href="https://www.djangoproject.com/download/" rel="external nofollow" target="_blank">site</a>.</p>

<p>Extraia o arquivo:</p>
{% highlight bash %}
tar xzvf Django-1.4.3.tar.gz
{% endhighlight %}

<p>Acesse a pasta:</p>
{% highlight bash %}
cd Django-1.4.3
{% endhighlight %}

<p>E instale:</p>
{% highlight bash %}
sudo python setup.py install
{% endhighlight %}

<p>Aguarde um instante e já teremos nosso ambiente Django para brincar!</p>

<h2 id="how-django-works">Entendendo o Django</h2>

<p>O Django é um framework MVC, ou seja, divide em três camadas nosso código, porém ele utiliza outro nome para o que conhecemos por model, view e controller. Com ele falamos em MVT, que é model, view e template. O que é isso?</p>

<ul>
  <li>Model é onde a lógica acontece, todo regra de negócio fica aqui.</li>
  <li>View é onde fazemos a intermediação entre a camada de lógica (model) e apresentação (template). Ela faz o mesmo papel dos controllers do Rails e CakePHP.</li>
  <li>Template é a camada de apresentação, deve ser usada lógica mínima aqui, o Django também não nos permite fazer muito além do que devemos. Essa camada faz o papel das views do Rails e CakePHP.</li>
</ul>

<p>A forma de trabalho do Django também é um pouco diferente do que muitos podem estar acostumados, com ele falamos em aplicações plugáveis. Esse conceito serve para aumentar a produtividade e evitar a repetição de código (don't repeat yourself).</p>

<p>Imagina que trabalhamos em uma empresa que faz sites e que em quase todos eles  temos uma galeria de fotos. Após já termos uma galeria pronta, o que você faria quando chegasse um novo serviço? Faria outra do início ou copiaria e adaptava uma já existente?</p>

<p>No Django, essa galeria de fotos seria uma aplicação plugável, assim toda vez que chegasse um novo serviço apenas teriamos que "plugar".</p>

<p>Cada novo site que chegasse na empresa seria um projeto Django, que nada mais é do que um conjunto de aplicações plugáveis e configurações específicas.</p>

<p>Assim temos a lógica: um projeto pode possuir muitas aplicações e uma aplicação pode estar em muitos projetos.</p>

<h2 id="creating-a-project">Criando um Projeto</h2>

<p>Acesse via terminal o local que deseja criar o projeto e execute o comando <code>django-admin.py startproject project_name</code>, substitua "project_name" pelo nome do seu projeto.</p>

<a href="{{ site.baseurl }}/assets/criando-primeiro-projeto-django.jpg"><img class="alignnone size-full wp-image-930" title="criando-primeiro-projeto-django" src="{{ site.baseurl }}/assets/criando-primeiro-projeto-django.jpg" alt="criando-primeiro-projeto-django"/></a>

<p>Será criado um diretório com o nome do projeto, ao acessar e listar o conteúdo veremos que temos outro diretório com o mesmo nome, o primeiro de fora não é importante, podemos dar o nome que quisermos, mas o interno será usado no projeto e deve-se tomar cuidado ao mudar.</p>

<a href="{{ site.baseurl }}/assets/estrutura-do-projeto-django.jpg"><img class="alignnone size-full wp-image-932" title="estrutura-do-projeto-django" src="{{ site.baseurl }}/assets/estrutura-do-projeto-django.jpg" alt="estrutura-do-projeto-django"/></a>

<p>Nesse ponto já podemos rodar o projeto, para isso execute o comando <code>python manage.py runserver</code> na pasta do projeto.</p>

<a href="{{ site.baseurl }}/assets/rodando-primeiro-projeto-django.jpg"><img class="alignnone size-full wp-image-934" title="rodando-primeiro-projeto-django" src="{{ site.baseurl }}/assets/rodando-primeiro-projeto-django.jpg" alt="rodando-primeiro-projeto-django"/></a>

<p>O Django validará os models (ainda não temos nenhum) e iniciará o servidor de desenvolvimento na porta 8000 por padrão, ao acessar o endereço <code>127.0.0.1:8000</code> obteremos a tela inicial.</p>

<div class="note">Podemos definir a porta que queremos rodar, basta colocar o número na frente. Ex: <code>python manage.py runserver 8080</code> (para porta "8080").</div>

<a href="{{ site.baseurl }}/assets/servidor-de-desenvolvimento-django-rodando.jpg"><img class="alignnone size-full wp-image-936" title="servidor-de-desenvolvimento-django-rodando" src="{{ site.baseurl }}/assets/servidor-de-desenvolvimento-django-rodando.jpg" alt="servidor-de-desenvolvimento-django-rodando"/></a>

<div class="alert">Esse servidor é apenas para desenvolvimento e não deve ser usado em produção, para isso escolha outro como Apache, Ngix etc..</div>

<h2 id="setting-project">Configurando o Projeto</h2>

<p>Abra o arquivo <code>settings.py</code> que está dentro da pasta do projeto e vamos fazer algumas configurações.</p>

<p>Defina os dados de administrador do site:</p>

{% highlight python %}
ADMINS = (
    ('Admin', 'admin@provedor.com'),
)
{% endhighlight %}

<p>Acerte o time zone e o language code para sua localidade:</p>

{% highlight python %}
TIME_ZONE = 'America/Sao_Paulo'
LANGUAGE_CODE = 'pt-br'
{% endhighlight %}

<p>Vamos configurar o banco de dados, defina os dados da conexão como abaixo para utilização do MySQL (adeque os dados de acesso para sua máquina):</p>

{% highlight python %}
DATABASES = {
    'default': {
        'ENGINE': 'django.db.backends.mysql', 
        'NAME': 'first_django_project',  
        'USER': 'root',                  
        'PASSWORD': '',                  
        'HOST': 'localhost',              
        'PORT': '',                      
    }
}
{% endhighlight %}

<div class="alert">
Não esqueça de criar um banco de dados com o nome definido acima, no meu caso, irei criar um chamado <code>first_django_project</code>.
</div>

<h3>Usando South para Migrar Banco de Dados</h3>

<p>O Django possui um comando chamado <code>syncdb</code>, toda vez que criamos uma aplicação com um model, precisamos rodar o comando <code>python manage.py syncdb</code> para que o Django varra nosso model e crie uma tabela com os campos definidos.</p>

<p>Isso é maravilhoso, única parte ruim, é que quando alteramos o model - implementamos um novo campo por exemplo, ele não espelha essa alteração para nós no banco de dados, então precisamos editar a tabela manualmente.</p>

<p>Para resolver isso, foi criado o <a href="https://pypi.python.org/pypi/South/" target="_blank" rel="external nofollow">South</a>, ele é um migrador inteligente de dados e banco de dados para projetos Django.</p>

<div class="note alert">Atualizado: a partir da versão 1.7, o Django possui suporte nativo à migrações, não sendo necessário o uso do South.</div>

<p>Primeiro, vamos instalar ele em nossa máquina através do comando:</p>

{% highlight bash %}
pip install south
{% endhighlight %}

<div class="note">Rode como super usuário ou com <code>sudo</code> caso obtenha erro.</div>

<p>Agora precisamos adicionar ele em nosso projeto. Lembra que eu disse lá em cima que um projeto Django é constituído de várias aplicações plugáveis? Então, agora precisamos "plugar" o South em nosso projeto, para isso adicione <code>south</code> em <code>INSTALLED_APPS</code> dentro do arquivo <code>settings.py</code>. Toda vez que precisarmos plugar uma aplicação em nosso projeto, deve-se adicionar o nome dela nessa tupla no arquivo de configuração.</p>

<p>Agora vamos rodar o comando responsável por criar as tabelas de nossa aplicação, execute:</p>

{% highlight bash %}
python manage.py syncdb
{% endhighlight %}

<p>O South utiliza algumas tabelas que ainda não estão criadas, por isso precisamos rodar o comando <code>syncdb</code>, mas será só dessa vez.</p>

<p>Veja o retorno do comando:</p>

<a href="{{ site.baseurl }}/assets/sincronizando-o-banco-de-dados-com-syncdb.jpg"><img class="alignnone size-full wp-image-944" title="sincronizando-o-banco-de-dados-com-syncdb" src="{{ site.baseurl }}/assets/sincronizando-o-banco-de-dados-com-syncdb.jpg" alt="sincronizando-o-banco-de-dados-com-syncdb"/></a>

<p>Como temos o sistema de autenticação <code>django.contrib.auth</code> que já vem por padrão nas aplicações instaladas, quando rodamos pela primeira vez o <code>syncdb</code>, o Django pergunta se queremos criar um usuário, é recomendado que já seja criado agora, isso será usado na área administrativa de nosso exemplo mais pra frente.</p>

<p>Quanto ao South, ainda precisamos definir algumas coisas mais, assim que criarmos nossa primeira aplicação volto a falar dele..</p>

<h2 id="creating-a-plugable-application">Criando uma Aplicação Plugável</h2>

<p>Vamos criar nossa primeira aplicação Django agora, para isso execute o comando <code>python manage.py startapp news</code> no diretório do projeto, "news" é o nome de nossa aplicação.</p>

<p>Será criado uma pasta com o nome da aplicação contendo os seguintes arquivos:</p>

<a href="{{ site.baseurl }}/assets/primeira-aplicacao-criada-no-django.jpg"><img class="alignnone size-full wp-image-947" title="primeira-aplicacao-criada-no-django" src="{{ site.baseurl }}/assets/primeira-aplicacao-criada-no-django.jpg" alt="primeira-aplicacao-criada-no-django"/></a>

<ul>
  <li>__init__.py: arquivo em branco que diz ao Python que esse diretório deve ser considerado como um Python package (veja mais <a href="http://docs.python.org/2/tutorial/modules.html#packages" target="_blank">aqui</a>);</li>
  <li>models.py: esse arquivo conterá os campos e as principais regras de negócio de nossa aplicação. Geralmente uma aplicação pode ter mais de um model por arquivo - diferentemente do CakePHP e Ruby on Rails, por isso é chamado "models";</li>
  <li>views.py: arquivo que fará a intemediação entre os models e os templates;</li>
  <li>tests.py: como o nome já diz, onde serão realizados os testes.</li>
</ul>

<p>Agora que criamos nossa aplicação, vamos plugar ela no projeto, lembra? Adicione a string <code>news</code> no <code>INSTALLED_APPS</code> do arquivo <code>settings.py</code>.</p>

Com nossa aplicação plugada, vamos criar nosso primeiro model então, abra o arquivo <code>models.py</code> e adicione o código:<p></p>

{% highlight python %}
# -*- coding: utf-8 -*-

from django.db import models

class News(models.Model):
  title = models.CharField('Título', max_length=100)
  publication_date = models.DateTimeField('Data de publicação', auto_now_add=True)
  content = models.TextField('Conteúdo')

  class Meta:
    verbose_name = 'notícia'
    verbose_name_plural = 'notícias'

  def __unicode__(self):
    return self.title
{% endhighlight %}

<div class="note">O trecho <code># -*- coding: utf-8 -*-</code> serve para informar qua estamos utilizando a codificação UTF-8.</div>

<p>Vamos analisar o que temos aqui..</p>

<p>Começamos criando uma classe <code>News</code> que herda de <code>models.Model</code> para termos as funcionalidades de um model Django.</p>

<p>Depois definimos três campos para nossa aplicação, um título de tamanho máximo de 100 caracteres, um campo de data que é preenchido automaticamente (<code>auto_now_add=True</code>) e outro para o conteúdo da notícia que é do tipo texto. Outros tipos de campos podem ser vistos <a href="https://docs.djangoproject.com/en/1.4/ref/models/fields/#field-types" rel="external nofollow" target="_blank">aqui</a> na documentação oficial do Django.</p>

<p>A classe <code>Meta</code> serve para definir algumas informações sobre o model, mais pra frente veremos seu uso.</p>

<p>O método <code>__unicode__</code> define o retorno padrão, nesse caso definimos o título.</p>

<p>Lembra do South? Então, sempre quando queremos automatizar uma aplicação para que as alterações nos models sejam espelhadas no banco de dados, precisamos criar uma migração inicial, ela nada mais é do que um arquivo que poussi a estrutura de nossos models. Para criar a migração inicial rode o comando <code>python manage.py schemamigration news --initial</code> substituindo "news" pelo nome de sua aplicação.</p>

<a href="{{ site.baseurl }}/assets/usando-south-para-migracoes-no-django.jpg"><img class="alignnone size-full wp-image-958" title="usando-south-para-migracoes-no-django" src="{{ site.baseurl }}/assets/usando-south-para-migracoes-no-django.jpg" alt="usando-south-para-migracoes-no-django" /></a>

<p>Depois de criada a migração inicial, vamos rodar ela agora para que as tabelas necessárias possam ser criadas no banco de dados, execute o comando <code>python manage.py migrate news</code>.</p>

<a href="{{ site.baseurl }}/assets/executando-migracao-com-south-em-projetos-django.jpg"><img class="alignnone size-full wp-image-961" title="executando-migracao-com-south-em-projetos-django" src="{{ site.baseurl }}/assets/executando-migracao-com-south-em-projetos-django.jpg" alt="executando-migracao-com-south-em-projetos-django"/></a>

<p>Daqui pra frente, sempre quando alterarmos os models da aplicação "news", basta executarmos <code>python manage.py schemamigration news --auto</code> para gerar a migração e depois <code>python manage.py migrate news</code> para que as alterações sejam efetuadas no banco de dados, assim não precisamos ficar nos preocupando com campos de tabelas e focamos no desenvolvimento.</p>

<div class="note">Podemos usar o comando <code>python manage.py migrate --list</code> para exibir todas migrações definidas e se elas já foram aplicadas ou não (lendo a tabela <code>south_migrationhistory</code>).</div>

<h2 id="admin-interface">Interface Administrativa</h2>

<p>Uma das melhores features do Django sem dúvida é a interface administrativa, com ela podemos rapidamente construir funcionalidades rotineiras que nos tomariam mais tempo e código utilizando outros ferramentas.</p>

<p>Ela já vem pronta e tudo o que precisamos fazer é plugar, para isso basta remover o comentário da linha <code>'django.contrib.admin'</code> no <code>INSTALLED_APPS</code> de nosso já velho conhecido arquivo <code>settings.py</code>.</p>

{% highlight python %}
INSTALLED_APPS = (
    'django.contrib.auth',
    'django.contrib.contenttypes',
    'django.contrib.sessions',
    'django.contrib.sites',
    'django.contrib.messages',
    'django.contrib.staticfiles',
    'south',
    'news',
    # Uncomment the next line to enable the admin:
    'django.contrib.admin',
    # Uncomment the next line to enable admin documentation:
    # 'django.contrib.admindocs',
)
{% endhighlight %}

<p>Caso você queira, também podem ativar a documentação da área administrativa removendo o comentário da linha <code>'django.contrib.admindocs'</code>, mas por enquanto não irei fazer isso.</p>

<p>A área administrativa já está ativa, só precisamos habilitar o acesso a ela, basta abrirmos o arquivo <code>urls.py</code> dentro da pasta do projeto e remover o comentário das linhas pertinentes ao admin. Ficaremos com algo assim:</p>

{% highlight python %}
from django.conf.urls import patterns, include, url

# Uncomment the next two lines to enable the admin:
from django.contrib import admin
admin.autodiscover()

urlpatterns = patterns('',
    # Examples:
    # url(r'^$', 'first_django_project.views.home', name='home'),
    # url(r'^first_django_project/', include('first_django_project.foo.urls')),

    # Uncomment the admin/doc line below to enable admin documentation:
    # url(r'^admin/doc/', include('django.contrib.admindocs.urls')),

    # Uncomment the next line to enable the admin:
    url(r'^admin/', include(admin.site.urls)),
)
{% endhighlight %}

<div class="note">O arquivo <code>urls.py</code> é responsável por definir todas urls de nosso projeto, ele tem a mesma função do <code>routes.rb</code> do Ruby on Rails.</div>

<p>Agora só falta criar a tabela de log utilizada pelo admin, rode <code>python manage.py syncdb</code> pra isso. Ao acessar o projeto no endereço <code>http://127.0.0.1:8000/</code> obteremos um aviso de página não encontrada, mas não se preocupe com isso no momento..</p>

<p>A área administrativa já está funcionando! Se você acessar o endereço <code>http://127.0.0.1:8000/admin</code> verá a tela de login.</p>

<a href="{{ site.baseurl }}/assets/area-administrativa-do-django.jpg"><img class="alignnone size-full wp-image-1028" title="area-administrativa-do-django" src="{{ site.baseurl }}/assets/area-administrativa-do-django.jpg" alt="area-administrativa-do-django"/></a>

<p>Lembra do usuário que criamos anteriormente? Use ele para fazer login.</p>

<a href="{{ site.baseurl }}/assets/aplicacoes-na-area-administrativa-do-django.jpg"><img class="alignnone size-full wp-image-1032" title="aplicacoes-na-area-administrativa-do-django" src="{{ site.baseurl }}/assets/aplicacoes-na-area-administrativa-do-django.jpg" alt="aplicacoes-na-area-administrativa-do-django"/></a>

<p>Na página inicial da interface administrativa podemos ver uma lista das aplicações plugáveis que temos registradas, vamos incluir ai nosso sistema de notícias também.</p>

<h3>Registrando Models no Admin</h3>

<p>Na pasta de nossa aplicação, crie um arquivo chamado <code>admin.py</code> e coloque o seguinte conteúdo:</p>

{% highlight python %}
from news.models import News
from django.contrib import admin

admin.site.register(News)
{% endhighlight %}

<p>Na primeira linha importamos o model de nossa aplicação, na segunda importamos o admin do Django e por últimos registramos nosso model <code>News</code> na área administrativa.</p>

<p>Feito isso, reinicie o servidor e atualize a página inicial do admin e lá estará o link para o CRUD (cadastro, leitura, atualização e exclusão) de notícias.</p>

<a href="{{ site.baseurl }}/assets/registrando-aplicacoes-no-admin-do-django.png"><img class="alignnone size-full wp-image-1036" title="registrando-aplicacoes-no-admin-do-django" src="{{ site.baseurl }}/assets/registrando-aplicacoes-no-admin-do-django.png" alt="registrando-aplicacoes-no-admin-do-django"/></a>

<p>Lembra da classe <code>Meta</code> que definimos dentro do model <code>News</code>? Nela criamos duas variáveis, uma chamada <code>verbose_name</code> e outra chamada <code>verbose_name_plural</code>, a primeira serve para dar nome no singular e a segunda no plural, observe que dentro da aplicação <code>News</code> na imagem acima temos um item chamado <code>Notícias</code>, ele é exatamente o <code>verbose_name_plural</code> com a primeira letra em caixa alta que definimos no model.</p>

<p>Agora, explore o admin e cadastre alguns registros no sistema de notícias, nosso próximo passo será fazer a listagem dos itens cadastrados na área pública do site.</p>

<h2 id="displaying-records">Listando Registros</h2>

<h3 id="urls">Urls</h3>

<p>Para fazer a listagem dos registros precisamos definir qual url será utilizada, abra o arquivo <code>urls.py</code> e adicione a linha abaixo:</p>

{% highlight python %}
url(r'^$', 'news.views.index', name='home'),
{% endhighlight %}

<div class="note">O mapeamento de urls no Django é feito com expressão regular.</div>
Aqui criamos uma url de nome home (<code>name='home'</code>) que mapeia o endereço raiz do site (através da expressão regular <code>^$</code>) para a view <code>index</code> que está no arquivo <code>views.py</code> da aplicação <code>news</code>.

<h3 id="views">Views</h3>

<p>Vamos criar a view responsável por exibir os registros, abra o arquivo <code>views.py</code> de nossa aplicação e adicione o seguinte código:</p>

{% highlight python %}
from django.shortcuts import render_to_response
from news.models import News

def index(request):
  return render_to_response('news/index.html',{
    'news': News.objects.all().order_by('-publication_date')
  })
{% endhighlight %}

<p>Nesse trecho fazemos as importações necessárias, criamos a view <code>index</code> que renderiza o template <code>news/index.html</code> e passamos a variável <code>news</code> contendo todas as notícias cadastradas ordenadas de forma decrescente (o <code>-</code> faz o papel de <code>DESC</code> no SQL) pela data de publicação.</p>

<div class="note">O Django nos fornece uma API para realizarmos operações com o banco de dados pelos models, no exemplo acima, utilizamos o método <code>all</code> para obter todos os registros, veja mais <a href="https://docs.djangoproject.com/en/1.4/topics/db/queries/#retrieving-objects" rel="external nofollow" target="_blank">aqui</a>.</div>

<h3 id="templates">Templates</h3>

<p>Precisamos agora dizer ao Django onde os templates de nossa aplicação serão armazenados, eu escolhi criar uma pasta chamada "templates" no mesmo nível do arquivo <code>manage.py</code>. No arquivo <code>settings.py</code> temos uma variável chamada <code>TEMPLATE_DIRS</code>, nela devemos adicionar os caminhos que o Django deve interpretar como templates do projeto, em meu arquivo eu deixei assim:</p>

{% highlight python %}
TEMPLATE_DIRS = (
    os.path.join(PROJECT_ROOT_PATH, '../templates/'),
    # Put strings here, like "/home/html/django_templates" or "C:/www/django/templates".
    # Always use forward slashes, even on Windows.
    # Don't forget to use absolute paths, not relative paths.
)
{% endhighlight %}

<p>E no começo do mesmo arquivo eu adiciono:</p>

{% highlight python %}
import os, sys
PROJECT_ROOT_PATH = os.path.dirname(os.path.abspath(__file__))
{% endhighlight %}

<p>Aqui fazemos importações das classes <code>os</code> e <code>sys</code> e utilizamos os métodos necessários para obter o caminho absoluto do arquivo <code>settings.py</code>.</p>

<p>Para finalizar, vamos criar o template de nossa view, crie um arquivo chamado <code>index.html</code> dentro de <code>templates/news</code> e adicione o seguinte conteúdo:</p>

{% highlight html %}
<h1>Notícias</h1>

{% for current in news %}
  <h2>{{current.title}}</h2>
  <p><strong>{{current.publication_date}}</strong></p>
  <p>{{current.content}}</p>
  <br/>
{% endfor %}
{% endhighlight %}

<div class="note">Utilize a tag <code>&#123;&#123;</code> de abertura e <code>&#125;&#125;</code> de fechamento para exibir dados.</div>

<p>Simplemente percorremos a variável <code>news</code> através de um laço de repetição e exibimos os dados cadastrados. Veja o resultado:</p>

<a href="{{ site.baseurl }}/assets/listando-registros-no-django.gif"><img class="alignnone size-full wp-image-1053" title="listando-registros-no-django" src="{{ site.baseurl }}/assets/listando-registros-no-django.gif" alt="listando-registros-no-django"/></a>

<p>O Django já exibe a data de acordo com a localização que definimos...</p>

<p>Por hoje é só pessoal, em breve volto com mais de Django. </p>

<p>O código fonte desse tutorial está em meu <a rel="external nofollow" target="_blank" href="https://github.com/glaucocustodio/glauco-blog-tutorials/tree/master/Come%C3%A7ando%20com%20Django">GitHub</a>. O que vocês acharam?</p>

<p>Até mais.</p>
